In [4]:
import sys #only needed to determine Python version number
import os #required to set current working directory
import pandas as pd

In [5]:
print('Python version ' + sys.version)
print('Pandas version ' + pd.__version__)

Python version 3.9.7 (default, Sep 16 2021, 16:59:28) [MSC v.1916 64 bit (AMD64)]
Pandas version 1.3.4

In [34]:
#os.getcwd()

In [11]:
os.chdir('C:\\Users\\freya\\UpdatedResource')

In [35]:
#os.getcwd()

In [13]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [15]:
# The initial set of names and age
names = ['Bob','Jessica','Mary','John','Mel','Liam','Olivia','Noah','Emma','Ava']
age = [48, 15, 27, 45, 36, 40, 81, 77, 90, 59]

In [16]:
DataSet = list(zip(names,age))
DataSet

[('Bob', 48),
 ('Jessica', 15),
 ('Mary', 27),
 ('John', 45),
 ('Mel', 36),
 ('Liam', 40),
 ('Olivia', 81),
 ('Noah', 77),
 ('Emma', 90),
 ('Ava', 59)]

In [17]:
# Create a dataframe from list
df = pd.DataFrame(data = DataSet, columns=['Names', 'Age'])
df

     Names  Age
0      Bob   48
1  Jessica   15
2     Mary   27
3     John   45
4      Mel   36
5     Liam   40
6   Olivia   81
7     Noah   77
8     Emma   90
9      Ava   59

### Basic Dataframe information

In [18]:
df.columns

Index(['Names', 'Age'], dtype='object')

In [19]:
# Understand how the shape work
df.shape?

In [12]:
df.shape

(10, 2)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Names   10 non-null     object
 1   Age     10 non-null     int64
dtypes: int64(1), object(1)
memory usage: 288.0+ bytes

In [15]:
df.Age.dtype

dtype('int64')

In [17]:
df.head(5)

     Names  Age
0      Bob   48
1  Jessica   15
2     Mary   27
3     John   45
4      Mel   36

In [19]:
df.tail(5)

    Names  Age
5    Liam   40
6  Olivia   81
7    Noah   77
8    Emma   90
9     Ava   59

In [20]:
df.describe()

             Age
count  10.000000
mean   51.800000
std    24.534783
min    15.000000
25%    37.000000
50%    46.500000
75%    72.500000
max    90.000000

In [21]:
df.describe(include='all')

       Names        Age
count     10  10.000000
unique    10        NaN
top      Bob        NaN
freq       1        NaN
mean     NaN  51.800000
std      NaN  24.534783
min      NaN  15.000000
25%      NaN  37.000000
50%      NaN  46.500000
75%      NaN  72.500000
max      NaN  90.000000

In [22]:
df.max()

Names    Olivia
Age          90
dtype: object

In [23]:
df.mean()

/var/folders/vg/knv8k4t949gbhzdyb1nl_p180000gn/T/ipykernel_47192/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Age    51.8
dtype: float64

In [24]:
df['Age'].max()

90

In [25]:
df['Age'].min()

15

In [26]:
df['Age'].mean()

51.8

In [27]:
df['Age'].median()

46.5

In [28]:
df['Names'].max()

'Olivia'

In [29]:
df['Names'].min()

'Ava'

In [31]:
# df['Names'].mean()

### Select Values

In [21]:
df['Names']

0        Bob
1    Jessica
2       Mary
3       John
4        Mel
5       Liam
6     Olivia
7       Noah
8       Emma
9        Ava
Name: Names, dtype: object

In [33]:
df.iloc[1:3]

     Names  Age
1  Jessica   15
2     Mary   27

In [30]:
#label based retrieval
df.loc[8]

Names    Emma
Age        90
Name: 8, dtype: object

In [38]:
df[df['Age'] >= 90]

  Names  Age
8  Emma   90

In [36]:
df[df['Names'] == 'Bob']

  Names  Age
0   Bob   48

### Add new columns

In [39]:
# Adding additional column in DataFrame
weights = [70, 55, 87, 95, 66, 80, 61, 97, 90, 89]
df['Weight'] = weights
df

     Names  Age  Weight
0      Bob   48      70
1  Jessica   15      55
2     Mary   27      87
3     John   45      95
4      Mel   36      66
5     Liam   40      80
6   Olivia   81      61
7     Noah   77      97
8     Emma   90      90
9      Ava   59      89

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Names   10 non-null     object
 1   Age     10 non-null     int64
 2   Weight  10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 368.0+ bytes

In [41]:
df.describe()

             Age    Weight
count  10.000000  10.00000
mean   51.800000  79.00000
std    24.534783  14.96663
min    15.000000  55.00000
25%    37.000000  67.00000
50%    46.500000  83.50000
75%    72.500000  89.75000
max    90.000000  97.00000

In [42]:
df['Ratio'] = df['Age'] / df['Weight']
df

     Names  Age  Weight     Ratio
0      Bob   48      70  0.685714
1  Jessica   15      55  0.272727
2     Mary   27      87  0.310345
3     John   45      95  0.473684
4      Mel   36      66  0.545455
5     Liam   40      80  0.500000
6   Olivia   81      61  1.327869
7     Noah   77      97  0.793814
8     Emma   90      90  1.000000
9      Ava   59      89  0.662921

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Names   10 non-null     object
 1   Age     10 non-null     int64
 2   Weight  10 non-null     int64
 3   Ratio   10 non-null     float64
dtypes: float64(1), int64(2), object(1)
memory usage: 448.0+ bytes

In [44]:
df.describe()

             Age    Weight      Ratio
count  10.000000  10.00000  10.000000
mean   51.800000  79.00000   0.657253
std    24.534783  14.96663   0.320732
min    15.000000  55.00000   0.272727
25%    37.000000  67.00000   0.480263
50%    46.500000  83.50000   0.604188
75%    72.500000  89.75000   0.766789
max    90.000000  97.00000   1.327869

### Sort Dataframe

In [45]:
# Sort Dataframe by Age
SortedAge = df.sort_values(['Age'], ascending=False)
SortedAge

     Names  Age  Weight     Ratio
8     Emma   90      90  1.000000
6   Olivia   81      61  1.327869
7     Noah   77      97  0.793814
9      Ava   59      89  0.662921
0      Bob   48      70  0.685714
3     John   45      95  0.473684
5     Liam   40      80  0.500000
4      Mel   36      66  0.545455
2     Mary   27      87  0.310345
1  Jessica   15      55  0.272727

In [46]:
# Sort Dataframe by Weight
SortedWeight = df.sort_values(['Weight'], ascending=False)
SortedWeight

     Names  Age  Weight     Ratio
7     Noah   77      97  0.793814
3     John   45      95  0.473684
8     Emma   90      90  1.000000
9      Ava   59      89  0.662921
2     Mary   27      87  0.310345
5     Liam   40      80  0.500000
0      Bob   48      70  0.685714
4      Mel   36      66  0.545455
6   Olivia   81      61  1.327869
1  Jessica   15      55  0.272727

In [47]:
df.sort_values?

### Altering Specific values

In [48]:
df

     Names  Age  Weight     Ratio
0      Bob   48      70  0.685714
1  Jessica   15      55  0.272727
2     Mary   27      87  0.310345
3     John   45      95  0.473684
4      Mel   36      66  0.545455
5     Liam   40      80  0.500000
6   Olivia   81      61  1.327869
7     Noah   77      97  0.793814
8     Emma   90      90  1.000000
9      Ava   59      89  0.662921

In [49]:
# Use of loc to change value of a cell
df.loc[1,'Age'] = 200
df

     Names  Age  Weight     Ratio
0      Bob   48      70  0.685714
1  Jessica  200      55  0.272727
2     Mary   27      87  0.310345
3     John   45      95  0.473684
4      Mel   36      66  0.545455
5     Liam   40      80  0.500000
6   Olivia   81      61  1.327869
7     Noah   77      97  0.793814
8     Emma   90      90  1.000000
9      Ava   59      89  0.662921

In [50]:
# Use of iloc to change value of a cell
df.iloc[1,2] = 200
df

     Names  Age  Weight     Ratio
0      Bob   48      70  0.685714
1  Jessica  200     200  0.272727
2     Mary   27      87  0.310345
3     John   45      95  0.473684
4      Mel   36      66  0.545455
5     Liam   40      80  0.500000
6   Olivia   81      61  1.327869
7     Noah   77      97  0.793814
8     Emma   90      90  1.000000
9      Ava   59      89  0.662921

### Dropping values

In [51]:
df.drop([2,  6])

     Names  Age  Weight     Ratio
0      Bob   48      70  0.685714
1  Jessica  200     200  0.272727
3     John   45      95  0.473684
4      Mel   36      66  0.545455
5     Liam   40      80  0.500000
7     Noah   77      97  0.793814
8     Emma   90      90  1.000000
9      Ava   59      89  0.662921

In [52]:
df.drop('Age', axis=1)

     Names  Weight     Ratio
0      Bob      70  0.685714
1  Jessica     200  0.272727
2     Mary      87  0.310345
3     John      95  0.473684
4      Mel      66  0.545455
5     Liam      80  0.500000
6   Olivia      61  1.327869
7     Noah      97  0.793814
8     Emma      90  1.000000
9      Ava      89  0.662921

In [53]:
df = df.drop([2,6])

In [54]:
df

     Names  Age  Weight     Ratio
0      Bob   48      70  0.685714
1  Jessica  200     200  0.272727
3     John   45      95  0.473684
4      Mel   36      66  0.545455
5     Liam   40      80  0.500000
7     Noah   77      97  0.793814
8     Emma   90      90  1.000000
9      Ava   59      89  0.662921

In [55]:
df = df.drop("Age", axis=1)
df

     Names  Weight     Ratio
0      Bob      70  0.685714
1  Jessica     200  0.272727
3     John      95  0.473684
4      Mel      66  0.545455
5     Liam      80  0.500000
7     Noah      97  0.793814
8     Emma      90  1.000000
9      Ava      89  0.662921